Renova/src/DataProcessors/ЗагрузкаДокументаАктНРП/ЗагрузкаДокументаАктНРП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДокументаАктНРП</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаЗагрузки</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Renova/src/Enums/ВидРемонта/ВидРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидРемонта</name>
  <enumValues>
    <name>Предторговый</name>
  </enumValues>
  <enumValues>
    <name>Гарантийный</name>
  </enumValues>
</mdclass:Enum>

Renova/src/Enums/ВидКлиента/ВидКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидКлиента</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Renova/src/Enums/ВидМестонахожденияНРП/ВидМестонахожденияНРП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидМестонахожденияНРП</name>
  <enumValues>
    <name>УКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВСервисномЦентре</name>
  </enumValues>
  <enumValues>
    <name>УПроизводителя</name>
  </enumValues>
</mdclass:Enum>

Renova/src/Documents/АктНРП/АктНРП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктНРП</name>
  <registerRecords>AccumulationRegister.АктыКонтрагентДатаСроки</registerRecords>
  <registerRecords>AccumulationRegister.АктыПродукцияИКод</registerRecords>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПродавца</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКлиента</name>
    <type>
      <types>EnumRef.ВидКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПокупки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаметкаДляПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНеисправности</name>
    <type>
      <types>CatalogRef.КодыНеисправностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплектность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Местонахождение</name>
    <type>
      <types>EnumRef.ВидМестонахожденияНРП</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРабот</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СервисныйЦентр</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПродавца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Renova/src/Catalogs/МоделиПродукции/МоделиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МоделиПродукции</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорииНоменклатуры</name>
    <type>
      <types>EnumRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>СимвольныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Код7ки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Renova/src/DataProcessors/ЗагрузкаДокументаАктНРП/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте   
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере() 
	
	ТабЗнач = РаботаСCSVСервер.ПрочитатьФайлCSV(Объект.ПутьКФайлу);

	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтотОбъект, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ТаблицаЗначений = Объект.ТаблицаЗагрузки.Выгрузить();
	
	СозданоДокументов = 0;
	// 1. Собираем все уникальные ID для проверки существующих актов
	УникальныеIDДокумента = Новый Массив;
	УникальниеВидыПродукции = Новый Массив;
	УникальныеКодыНеисправностей = Новый Массив;
	УникальнаяНоменклатура = Новый Массив;
	УникальныеIDПродукции = Новый Массив;
	УникальныеСервисныеЦентры = Новый Массив;
	
	// Собираем данные с безопасным преобразованием
	Для каждого СтрокаДанных из ТаблицаЗначений Цикл		
		// Для ID документа акт
		ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.id);
		Если ЧислоID <> Неопределено Тогда
			Если УникальныеIDДокумента.Найти(ЧислоID) = Неопределено Тогда  
				УникальныеIDДокумента.Добавить(ЧислоID);
			КонецЕсли;
		КонецЕсли;
		
		// Для ID видов продукции
		ЧислоProductID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.product_id);
		Если ЧислоProductID <> Неопределено Тогда
			Если УникальниеВидыПродукции.Найти(ЧислоProductID) = Неопределено Тогда  
				УникальниеВидыПродукции.Добавить(ЧислоProductID);
			КонецЕсли;
		КонецЕсли;
		
		// Для ID кодов неисправностей
		ЧислоCodeID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.code_id);
		Если ЧислоCodeID <> Неопределено Тогда
			Если УникальныеКодыНеисправностей.Найти(ЧислоCodeID) = Неопределено Тогда  
				УникальныеКодыНеисправностей.Добавить(ЧислоCodeID);
			КонецЕсли;
		КонецЕсли;     
		
		// Для ID сервисного центра
		ЧислоCenterID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.center_id);
		Если ЧислоCenterID <> Неопределено Тогда
			Если УникальныеСервисныеЦентры.Найти(ЧислоCenterID) = Неопределено Тогда  
				УникальныеСервисныеЦентры.Добавить(ЧислоCenterID);
			КонецЕсли;
		КонецЕсли;
		
		
		// Для наименования номенклатуры
		Если ЗначениеЗаполнено(СтрокаДанных.model_description) Тогда
			Если УникальнаяНоменклатура.Найти(СтрокаДанных.model_description) = Неопределено Тогда  
				УникальнаяНоменклатура.Добавить(СтрокаДанных.model_description);
			КонецЕсли;
		КонецЕсли; 
		
		// Для ID моделей продукции
		ЧислоModelID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.model_id);
		Если ЧислоModelID <> Неопределено Тогда
			Если УникальныеIDПродукции.Найти(ЧислоModelID) = Неопределено Тогда  
				УникальныеIDПродукции.Добавить(ЧислоModelID);
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЦикла;	
	
	// 3. Получаем соответствия 
	СоответствиеСуществующегоДокумента = СоответствияСервер.ПолучитьСоответствиеДокументаАкт_НРП(УникальныеIDДокумента);
	СоответствиеВидовПродукции = СоответствияСервер.ПолучитьСоответствиеВидовПродукцииОбщая(УникальниеВидыПродукции);  
	СоответствиеКодовНеисправностей = СоответствияСервер.ПолучитьСоответствиеКодовНеисправностей(УникальныеКодыНеисправностей); 
	СоответствиеНоменклатурыПоНаименованию = СоответствияСервер.ПолучитьСоответствиеНоменклатуры(УникальнаяНоменклатура, Ложь); 
	СоответствиеIDПродукции = СоответствияСервер.ПолучитьСоответствиеНоменклатуры(УникальныеIDПродукции); 
	СоответствиеСервисныхЦентров = СоответствияСервер.ПолучитьСервисныеЦентры(УникальныеСервисныеЦентры); 
	
	Гарантийный = Перечисления.ВидРемонта.Гарантийный;	
	Предторговый = Перечисления.ВидРемонта.Предторговый; 
	ЮридическоеЛицо = Перечисления.ВидКлиента.ЮридическоеЛицо;
	ФизическоеЛицо = Перечисления.ВидКлиента.ФизическоеЛицо; 
	УКлиента = Перечисления.ВидМестонахожденияНРП.УКлиента;
	ВСервисномЦентре = Перечисления.ВидМестонахожденияНРП.ВСервисномЦентре;
	УПроизводителя = Перечисления.ВидМестонахожденияНРП.УПроизводителя;
	
	// 5. Создаем документ ремонт
	Для каждого СтрокаДанных из ТаблицаЗначений Цикл
		
		// Получаем числовые ID
		ЧислоIDДокумента = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.id);
		Если ЧислоIDДокумента = Неопределено Тогда
			// Не можем обработать строку без ID
			Продолжить;
		КонецЕсли;
		
		// Проверяем, существует ли уже документ с таким IDСайта
		Если СоответствиеСуществующегоДокумента[ЧислоIDДокумента] <> Неопределено Тогда
			// документ уже существует, пропускаем создание
			Продолжить;			
		КонецЕсли; 
		
		НовыйЭлемент = Документы.АктНРП.СоздатьДокумент();
		//Заполняем номер документа с IDСайта
		НовыйЭлемент.Номер = ЧислоIDДокумента;
		НовыйЭлемент.IDСайта = ЧислоIDДокумента;
			
		// Заполнение даты документа
		Если ЗначениеЗаполнено(СтрокаДанных.doc_date) Тогда
			НовыйЭлемент.Дата = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.doc_date);
		КонецЕсли;
		
		// Заполнение вида ремонта		
		Если СтрокаДанных.work_type = "warranty" Тогда 
			НовыйЭлемент.ВидРемонта = Гарантийный;
		Иначе 
			НовыйЭлемент.ВидРемонта = Предторговый;
		КонецЕсли; 
		
		// Заполнение видов продукции
		Если ЗначениеЗаполнено(СтрокаДанных.product_id) Тогда 
			ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.product_id);
			Если ЧислоID <> Неопределено Тогда
				СсылкаНаВидПродукции = СоответствиеВидовПродукции[ЧислоID];
				Если СсылкаНаВидПродукции <> Неопределено Тогда
					НовыйЭлемент.ВидПродукции = СсылкаНаВидПродукции;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Серийный номер
		НовыйЭлемент.СерийныйНомер = СтрокаДанных.serial_number;
		
		// Вид клиента
		Если ЗначениеЗаполнено(СтрокаДанных.client_type) Тогда
			Если СтрокаДанных.client_type = "organization" Тогда
				НовыйЭлемент.ВидКлиента = ЮридическоеЛицо;	
			Иначе
				НовыйЭлемент.ВидКлиента = ФизическоеЛицо;
			КонецЕсли;
		КонецЕсли;
		
		// Личные данные клиента
		НовыйЭлемент.Клиент = СтрокаДанных.client;
		НовыйЭлемент.ТелефонКлиента = СтрокаДанных.client_phone;
		НовыйЭлемент.АдресКлиента = СтрокаДанных.client_addr; 
		
		// Дата покупки 
		Если ЗначениеЗаполнено(СтрокаДанных.buy_date) Тогда
			НовыйЭлемент.ДатаПокупки = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.buy_date);
		КонецЕсли;
		
		// Дата приема
		Если ЗначениеЗаполнено(СтрокаДанных.receipt_date) Тогда
			НовыйЭлемент.ДатаПриема = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.receipt_date);
		КонецЕсли; 
		
		//заметка для пользователя
		Если ЗначениеЗаполнено(СтрокаДанных.member_for_user) Тогда
			НовыйЭлемент.ЗаметкаДляПользователя = СтрокаДанных.member_for_user;
		КонецЕсли;
		
		// Описание неисправности 
		Если ЗначениеЗаполнено(СтрокаДанных.problem_description) Тогда
			НовыйЭлемент.ОписаниеНеисправности = СтрокаДанных.problem_description;
		КонецЕсли;		
		// Коды неисправностей
		Если ЗначениеЗаполнено(СтрокаДанных.code_id) Тогда            
			ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.code_id);
			Если ЧислоID <> Неопределено Тогда
				СсылкаНаКодНеисправности = СоответствиеКодовНеисправностей[ЧислоID];
				Если СсылкаНаКодНеисправности <> Неопределено Тогда
					НовыйЭлемент.КодНеисправности = СсылкаНаКодНеисправности;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		// Заполнение сервисного центра по ID
		Если ЗначениеЗаполнено(СтрокаДанных.center_id) Тогда
			ЧислоCenterID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.center_id);
			Если ЧислоCenterID <> Неопределено Тогда
				СсылкаНаIDСервисногоЦентра = СоответствиеСервисныхЦентров[ЧислоCenterID];
				Если СсылкаНаIDСервисногоЦентра <> Неопределено Тогда
					НовыйЭлемент.СервисныйЦентр = СсылкаНаIDСервисногоЦентра;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Комплектность    
		Если ЗначениеЗаполнено(СтрокаДанных.completeness) Тогда
			НовыйЭлемент.Комплектность = СтрокаДанных.completeness; 
		КонецЕсли;
		
		// Описание работ 
		Если ЗначениеЗаполнено(СтрокаДанных.work_description) Тогда
			НовыйЭлемент.ОписаниеРабот = СтрокаДанных.work_description;
		КонецЕсли;
		
		//Продавец    
		Если ЗначениеЗаполнено(СтрокаДанных.shop) Тогда
			НовыйЭлемент.Продавец = СтрокаДанных.shop; 
		КонецЕсли;
		
		//Телефон продавца    
		Если ЗначениеЗаполнено(СтрокаДанных.shop_phone) Тогда
			НовыйЭлемент.ТелефонПродавца = СтрокаДанных.shop_phone; 
		КонецЕсли;
		
		//Адрес продавца    
		Если ЗначениеЗаполнено(СтрокаДанных.shop_addr) Тогда
			НовыйЭлемент.АдресПродавца = СтрокаДанных.shop_addr; 
		КонецЕсли;
		
		//Решение    
		Если ЗначениеЗаполнено(СтрокаДанных.decree) Тогда
			НовыйЭлемент.Решение = СтрокаДанных.decree; 
		КонецЕсли;
		
		//Местонахождение    
		Если ЗначениеЗаполнено(СтрокаДанных.device_location) Тогда 
			Если СтрокаДанных.device_location = "manufacture" Тогда
				НовыйЭлемент.Местонахождение = УПроизводителя;	
			КонецЕсли;
			Если СтрокаДанных.device_location = "workshop" Тогда
				НовыйЭлемент.Местонахождение = ВСервисномЦентре;	
			КонецЕсли;
			Если СтрокаДанных.device_location = "client" Тогда
				НовыйЭлемент.Местонахождение = УКлиента;	
			КонецЕсли;		
		КонецЕсли; 
		
		//Примечание    
		Если ЗначениеЗаполнено(СтрокаДанных.note) Тогда
			НовыйЭлемент.Примечание = СтрокаДанных.note;  
		КонецЕсли;
		
		//Почта клиента    
		Если ЗначениеЗаполнено(СтрокаДанных.client_email) Тогда
			НовыйЭлемент.ПочтаКлиента = СтрокаДанных.client_email;  
		КонецЕсли;
		
		// Заполнение номенклатуры           
		
		СсылкаНаНаименование = СоответствиеНоменклатурыПоНаименованию[СтрокаДанных.model_description];
		СсылкаНаIDПродукции = Неопределено; 		
		Если СсылкаНаНаименование <> Неопределено Тогда
			НовыйЭлемент.МодельПродукции = СсылкаНаНаименование;
		Иначе
			 //Пробуем найти по ID
			Если ЗначениеЗаполнено(СтрокаДанных.model_id) Тогда
				ЧислоModelID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.model_id);
				Если ЧислоModelID <> Неопределено Тогда
					СсылкаНаIDПродукции = СоответствиеIDПродукции[ЧислоModelID];
					Если СсылкаНаIDПродукции <> Неопределено Тогда
						НовыйЭлемент.МодельПродукции = СсылкаНаIDПродукции;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
			
		// Создание новой модели, если не найдена ни по наименованию, ни по ID
		Если СсылкаНаНаименование = Неопределено И СсылкаНаIDПродукции = Неопределено Тогда 
			НоваяМодель = Справочники.МоделиПродукции.СоздатьЭлемент();
			НоваяМодель.Наименование = СтрокаДанных.model_description;
			НоваяМодель.Родитель = НовыйЭлемент.ВидПродукции;
			НоваяМодель.Записать();
			СсылкаНаМодель = НоваяМодель.Ссылка;
			
			НовыйЭлемент.МодельПродукции = СсылкаНаМодель;
			
			// Обновляем соответствия
			СоответствиеНоменклатурыПоНаименованию.Вставить(СтрокаДанных.model_description, СсылкаНаМодель);
		КонецЕсли;
			
		Попытка
			НовыйЭлемент.Записать(РежимЗаписиДокумента.Проведение);  
			
			СозданоДокументов = СозданоДокументов + 1; 
			
		Исключение
			// Логируем ошибку, но продолжаем обработку остальных документов
			ТекстСообщенияПользователю = СтрШаблон("Ошибка при записи документа: %1", ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю);
		КонецПопытки;
		
	КонецЦикла;
	
	ТекстСообщенияПользователю = СтрШаблон("Загружено и создано %1 документов ", СозданоДокументов);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю);

КонецПроцедуры

#КонецОбласти
